src/Tasks/ЗадачаОтветственному/ЗадачаОтветственному.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаОтветственному</name>
  <attributes>
    <name>ИмяВызываемогоМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОткрываемойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗадачи</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>CatalogRef.ТипыЗадачКонтрольМониторингСистемныхОшибок</types>
      <types>CatalogRef.ТипыЗадачСборДампов</types>
      <types>CatalogRef.ТипыЗадачАнализВызововКластера1С</types>
      <types>CatalogRef.ТипыЗадач</types>
      <types>CatalogRef.ТипыЗадачОценкаПользователей</types>
      <types>CatalogRef.ТипыЗадачКонтрольПроизводительности</types>
      <types>CatalogRef.ТипыЗадачКонтрольПамяти</types>
      <types>CatalogRef.ТипыЗадачКонтрольНагрузочныхТестов</types>
      <types>CatalogRef.ТипыЗадачКонтрольПодключений</types>
      <types>CatalogRef.ТипыЗадачВнешнийКонтрольЦКК</types>
      <types>CatalogRef.ТипыЗадачКонтрольРегламентныхЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОповещения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаОтветственномуЗаВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачиИзменился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСтраницыСправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменяемыеПараметрыЗадачи</name>
    <type>
      <types>CatalogRef.ОписаниеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоручениеДополнительныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОписаниеПоручения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекстОповещения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОткрытияФормы</name>
    <attributes>
      <name>ИмяПараметра</name>
      <comment>Имя параметра может быть составным, например, &quot;Объект.Владелец&quot;.</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьПриСозданииНаСервере</name>
      <comment>Использовать параметр при создании формы на сервере</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыЗадачи</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.ВариантыДампов</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Инциденты</name>
    <comment>Инциденты</comment>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформацияОбИнциденте</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ТипыИсполнителейКонтрольПамяти</types>
      <types>CatalogRef.ТипыИсполнителей</types>
      <types>CatalogRef.ТипыИсполнителейВнешнийКонтрольЦКК</types>
      <types>CatalogRef.ТипыИсполнителейАнализВызововКластера1С</types>
      <types>CatalogRef.ТипыИсполнителейОценкаПользователей</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольПодключений</types>
      <types>CatalogRef.ТипыИсполнителейСборДампов</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольПроизводительности</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольРегламентныхЗаданий</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольЧислаИсключений</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольНагрузочныхТестов</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/InformationRegisters/ЖурналКонтроля/ЖурналКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналКонтроля</name>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ЗаголовкиЖурналаКонтроля/ЗаголовкиЖурналаКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗаголовкиЖурналаКонтроля</name>
  <enumValues>
    <name>СформированаЗадача</name>
  </enumValues>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>ВыполненаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженаПроблема</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
</mdclass:Enum>

src/Tasks/ЗадачаОтветственному/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли; 

	Источник = ЭтотОбъект.ИсточникЗадачи;
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.КонтрольныеПроцедуры")
		И ЭтотОбъект.ТипЗадачи <> Справочники.ТипыЗадач.ПерезапускКонтрольнойПроцедуры
	Тогда
				
		Если ЭтотОбъект.СтатусЗадачиИзменился И ЭтотОбъект.Выполнена Тогда
			
			Попытка
				ИсточникЗадачи.ПолучитьОбъект().ПриВыполненииЗадачи(ЭтотОбъект.Ссылка);
			Исключение
				Сообщение = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Отладка.Ошибка(Сообщение);
			КонецПопытки;
			
			Общий.ЗаписатьВЖурналКонтроля(
				0,
				Источник, 
				Перечисления.ЗаголовкиЖурналаКонтроля.ВыполненаЗадача, 
				"Пользователь '" + Строка(СловарьСервер.ТекущийПользователь()) + "' выполнил задачу """ 
					+ Строка(ЭтотОбъект.ТипЗадачи.Наименование) + """",
				ЭтотОбъект.Ссылка,
				Ложь
			);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Исполнитель = Неопределено Тогда
		ВызватьИсключение "Задача ответственному. Не указан исполнитель или ошибочный тип исполнителя.";
	КонецЕсли;
		
	ЭтотОбъект.СтатусЗадачиИзменился = (ЭтотОбъект.Выполнена <> ЭтотОбъект.Ссылка.Выполнена) ИЛИ Общий.ЭтоНовыйОбъект(ЭтотОбъект);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
    
    Если ЗначениеЗаполнено(ЭтотОбъект.ИзменяемыеПараметрыЗадачи) Тогда
		ОписаниеЗадачи = ЭтотОбъект.ИзменяемыеПараметрыЗадачи.ПолучитьОбъект();
		ОписаниеЗадачи.Удалить();
	КонецЕсли;
	
	//проверка, что нет записи в регистре ЖурналКонтроля
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналКонтроля.Период,
	|	ЖурналКонтроля.КонтрольнаяПроцедура,
	|	ЖурналКонтроля.НомерСообщения,
	|	ЖурналКонтроля.ЗаписьБизнесПроцесса,
	|	ЖурналКонтроля.Описание,
	|	ЖурналКонтроля.Результат,
	|	ЖурналКонтроля.ЗадачаСсылка
	|ИЗ
	|	РегистрСведений.ЖурналКонтроля КАК ЖурналКонтроля
	|ГДЕ
	|	ЖурналКонтроля.ЗадачаСсылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ЖурналКонтроля.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		Попытка
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда 
				МенеджерЗаписи.Удалить();
			КонецЕсли;
		Исключение
			Инфо = ИнформацияОбОшибке();
			Комментарий =
			"Описание = '" +Инфо.Описание + "', " +
			"ИмяМодуля = '" + Инфо.ИмяМодуля + "', " +
			"НомерСтроки = '" + Инфо.НомерСтроки + "', " +
			"ИсходнаяСтрока = '" + Инфо.ИсходнаяСтрока + "', " +
			"Описание ошибки = '" + ОписаниеОшибки() + "'.";
			
			ЗаписьЖурналаРегистрации(
			"Процедура Задача.ЗадачаОтветственному.МодульОбъекта.ПередУдалением(Отказ)",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Задачи.ЗадачаОтветственному,
			,
			Комментарий);;
		КонецПопытки;		
	КонецЦикла

КонецПроцедуры

#КонецЕсли
